susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32L4P.h
#define PSSI_D13_PG15_ PG15,GPIO_AF10
#define PSSI_D13_PI0_ PI0,GPIO_AF10
#define _PSSI_D13_PG15_ 1
#define _PSSI_D13_PI0_ 1

#define PSSI_D14_PA5_ PA5,GPIO_AF4
#define PSSI_D14_PH4_ PH4,GPIO_AF10
#define PSSI_D14_PI10_ PI10,GPIO_AF10
#define _PSSI_D14_PA5_ 1
#define _PSSI_D14_PH4_ 1
#define _PSSI_D14_PI10_ 1

#define PSSI_D15_PC5_ PC5,GPIO_AF4
#define PSSI_D15_PF10_ PF10,GPIO_AF4
#define PSSI_D15_PI11_ PI11,GPIO_AF10
#define _PSSI_D15_PC5_ 1
#define _PSSI_D15_PF10_ 1
#define _PSSI_D15_PI11_ 1

#define PSSI_D2_PC11_ PC11,GPIO_AF4
#define PSSI_D2_PC8_ PC8,GPIO_AF10
#define PSSI_D2_PE0_ PE0,GPIO_AF10
#define PSSI_D2_PH11_ PH11,GPIO_AF10
#define _PSSI_D2_PC11_ 1
#define _PSSI_D2_PC8_ 1
#define _PSSI_D2_PE0_ 1
#define _PSSI_D2_PH11_ 1

#define PSSI_D3_PC9_ PC9,GPIO_AF4
#define PSSI_D3_PE1_ PE1,GPIO_AF10
#define PSSI_D3_PH12_ PH12,GPIO_AF10
#define _PSSI_D3_PC9_ 1
#define _PSSI_D3_PE1_ 1
#define _PSSI_D3_PH12_ 1

#define PSSI_D4_PC11_ PC11,GPIO_AF10
#define PSSI_D4_PE4_ PE4,GPIO_AF10
#define PSSI_D4_PH14_ PH14,GPIO_AF10
#define _PSSI_D4_PC11_ 1
#define _PSSI_D4_PE4_ 1
#define _PSSI_D4_PH14_ 1

#define PSSI_D5_PB6_ PB6,GPIO_AF10
#define PSSI_D5_PD3_ PD3,GPIO_AF4
#define PSSI_D5_PI4_ PI4,GPIO_AF10
#define _PSSI_D5_PB6_ 1
#define _PSSI_D5_PD3_ 1
#define _PSSI_D5_PI4_ 1

#define PSSI_D6_PB8_ PB8,GPIO_AF10
#define PSSI_D6_PE5_ PE5,GPIO_AF10
#define PSSI_D6_PI6_ PI6,GPIO_AF10
#define _PSSI_D6_PB8_ 1
#define _PSSI_D6_PE5_ 1
#define _PSSI_D6_PI6_ 1

#define PSSI_D7_PB9_ PB9,GPIO_AF10
#define PSSI_D7_PE6_ PE6,GPIO_AF10
#define PSSI_D7_PI7_ PI7,GPIO_AF10
#define _PSSI_D7_PB9_ 1
#define _PSSI_D7_PE6_ 1
#define _PSSI_D7_PI7_ 1

#define PSSI_D8_PC10_ PC10,GPIO_AF10
#define PSSI_D8_PH6_ PH6,GPIO_AF10
#define PSSI_D8_PI1_ PI1,GPIO_AF10
#define _PSSI_D8_PC10_ 1
#define _PSSI_D8_PH6_ 1
#define _PSSI_D8_PI1_ 1

#define PSSI_D9_PC12_ PC12,GPIO_AF10
#define PSSI_D9_PH7_ PH7,GPIO_AF10
#define PSSI_D9_PI2_ PI2,GPIO_AF10
#define _PSSI_D9_PC12_ 1
#define _PSSI_D9_PH7_ 1
#define _PSSI_D9_PI2_ 1

#define PSSI_DE_PA4_ PA4,GPIO_AF10
#define PSSI_DE_PD8_ PD8,GPIO_AF10
#define PSSI_DE_PH8_ PH8,GPIO_AF10
#define _PSSI_DE_PA4_ 1
#define _PSSI_DE_PD8_ 1
#define _PSSI_DE_PH8_ 1

#define PSSI_PDCK_PA6_ PA6,GPIO_AF4
#define PSSI_PDCK_PD9_ PD9,GPIO_AF10
#define PSSI_PDCK_PH5_ PH5,GPIO_AF10
#define _PSSI_PDCK_PA6_ 1
#define _PSSI_PDCK_PD9_ 1
#define _PSSI_PDCK_PH5_ 1

#define PSSI_RDY_PB7_ PB7,GPIO_AF10
#define PSSI_RDY_PC10_ PC10,GPIO_AF4
#define PSSI_RDY_PI5_ PI5,GPIO_AF10
#define _PSSI_RDY_PB7_ 1
#define _PSSI_RDY_PC10_ 1
#define _PSSI_RDY_PI5_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_PA8_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define SAI1_CK1_PA3_ PA3,GPIO_AF3
#define SAI1_CK1_PB8_ PB8,GPIO_AF3
#define SAI1_CK1_PE2_ PE2,GPIO_AF3
#define SAI1_CK1_PG7_ PG7,GPIO_AF3
#define _SAI1_CK1_PA3_ 1
#define _SAI1_CK1_PB8_ 1
#define _SAI1_CK1_PE2_ 1
#define _SAI1_CK1_PG7_ 1

#define SAI1_CK2_PA8_ PA8,GPIO_AF3
#define SAI1_CK2_PE5_ PE5,GPIO_AF3
#define _SAI1_CK2_PA8_ 1
#define _SAI1_CK2_PE5_ 1

#define SAI1_D1_PA10_ PA10,GPIO_AF3
#define SAI1_D1_PC3_ PC3,GPIO_AF3
#define SAI1_D1_PD6_ PD6,GPIO_AF3
#define SAI1_D1_PE6_ PE6,GPIO_AF3
#define _SAI1_D1_PA10_ 1
#define _SAI1_D1_PC3_ 1
#define _SAI1_D1_PD6_ 1
#define _SAI1_D1_PE6_ 1

#define SAI1_D2_PB9_ PB9,GPIO_AF3
#define SAI1_D2_PE4_ PE4,GPIO_AF3
#define _SAI1_D2_PB9_ 1
#define _SAI1_D2_PE4_ 1

#define SAI1_D3_PC5_ PC5,GPIO_AF3
#define SAI1_D3_PF10_ PF10,GPIO_AF13
#define _SAI1_D3_PC5_ 1
#define _SAI1_D3_PF10_ 1

#define SAI1_EXTCLK_PA0_ PA0,GPIO_AF13
#define SAI1_EXTCLK_PB0_ PB0,GPIO_AF13
#define _SAI1_EXTCLK_PA0_ 1
#define _SAI1_EXTCLK_PB0_ 1

#define SAI1_FS_A_PA9_ PA9,GPIO_AF13
#define SAI1_FS_A_PB9_ PB9,GPIO_AF13
#define SAI1_FS_A_PE4_ PE4,GPIO_AF13
#define _SAI1_FS_A_PA9_ 1
#define _SAI1_FS_A_PB9_ 1
#define _SAI1_FS_A_PE4_ 1

#define SAI1_FS_B_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF13
#define SAI1_FS_B_PA4_ PA4,GPIO_AF13
#define SAI1_FS_B_PB6_ PB6,GPIO_AF13
#define SAI1_FS_B_PE9_ PE9,GPIO_AF13
#define SAI1_FS_B_PF9_ PF9,GPIO_AF13
#define _SAI1_FS_B_PA14 (JTCK/SWCLK)_ 1
#define _SAI1_FS_B_PA4_ 1
#define _SAI1_FS_B_PB6_ 1
#define _SAI1_FS_B_PE9_ 1
#define _SAI1_FS_B_PF9_ 1

#define SAI1_MCLK_A_PA3_ PA3,GPIO_AF13
#define SAI1_MCLK_A_PB8_ PB8,GPIO_AF13
#define SAI1_MCLK_A_PE2_ PE2,GPIO_AF13
#define SAI1_MCLK_A_PG7_ PG7,GPIO_AF13
#define _SAI1_MCLK_A_PA3_ 1
#define _SAI1_MCLK_A_PB8_ 1
#define _SAI1_MCLK_A_PE2_ 1
#define _SAI1_MCLK_A_PG7_ 1

#define SAI1_MCLK_B_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF13
#define SAI1_MCLK_B_PE10_ PE10,GPIO_AF13
#define SAI1_MCLK_B_PF7_ PF7,GPIO_AF13
#define _SAI1_MCLK_B_PB4 (NJTRST)_ 1
#define _SAI1_MCLK_B_PE10_ 1
#define _SAI1_MCLK_B_PF7_ 1

#define SAI1_SCK_A_PA8_ PA8,GPIO_AF13
#define SAI1_SCK_A_PB10_ PB10,GPIO_AF13
#define SAI1_SCK_A_PE5_ PE5,GPIO_AF13
#define _SAI1_SCK_A_PA8_ 1
#define _SAI1_SCK_A_PB10_ 1
#define _SAI1_SCK_A_PE5_ 1

#define SAI1_SCK_B_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF13
#define SAI1_SCK_B_PE8_ PE8,GPIO_AF13
#define SAI1_SCK_B_PF8_ PF8,GPIO_AF13
#define _SAI1_SCK_B_PB3 (JTDO/TRACESWO)_ 1
#define _SAI1_SCK_B_PE8_ 1
#define _SAI1_SCK_B_PF8_ 1

#define SAI1_SD_A_PA10_ PA10,GPIO_AF13
#define SAI1_SD_A_PC1_ PC1,GPIO_AF13
#define SAI1_SD_A_PC3_ PC3,GPIO_AF13
#define SAI1_SD_A_PD6_ PD6,GPIO_AF13
#define SAI1_SD_A_PE6_ PE6,GPIO_AF13
#define _SAI1_SD_A_PA10_ 1
#define _SAI1_SD_A_PC1_ 1
#define _SAI1_SD_A_PC3_ 1
#define _SAI1_SD_A_PD6_ 1
#define _SAI1_SD_A_PE6_ 1

#define SAI1_SD_B_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF13
#define SAI1_SD_B_PB5_ PB5,GPIO_AF13
#define SAI1_SD_B_PE3_ PE3,GPIO_AF13
#define SAI1_SD_B_PE7_ PE7,GPIO_AF13
#define SAI1_SD_B_PF6_ PF6,GPIO_AF13
#define _SAI1_SD_B_PA13 (JTMS/SWDIO)_ 1
#define _SAI1_SD_B_PB5_ 1
#define _SAI1_SD_B_PE3_ 1
#define _SAI1_SD_B_PE7_ 1
#define _SAI1_SD_B_PF6_ 1

#define SAI2_EXTCLK_PA2_ PA2,GPIO_AF13
#define SAI2_EXTCLK_PC9_ PC9,GPIO_AF13
#define _SAI2_EXTCLK_PA2_ 1
#define _SAI2_EXTCLK_PC9_ 1

#define SAI2_FS_A_PB12_ PB12,GPIO_AF13
#define SAI2_FS_A_PC0_ PC0,GPIO_AF13
#define SAI2_FS_A_PD12_ PD12,GPIO_AF13
#define SAI2_FS_A_PG10_ PG10,GPIO_AF13
#define _SAI2_FS_A_PB12_ 1
#define _SAI2_FS_A_PC0_ 1
#define _SAI2_FS_A_PD12_ 1
#define _SAI2_FS_A_PG10_ 1

#define SAI2_FS_B_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF13
#define SAI2_FS_B_PG3_ PG3,GPIO_AF13
#define _SAI2_FS_B_PA15 (JTDI)_ 1
#define _SAI2_FS_B_PG3_ 1

#define SAI2_MCLK_A_PB14_ PB14,GPIO_AF13
#define SAI2_MCLK_A_PC6_ PC6,GPIO_AF13
#define SAI2_MCLK_A_PD9_ PD9,GPIO_AF13
#define SAI2_MCLK_A_PG11_ PG11,GPIO_AF13
#define _SAI2_MCLK_A_PB14_ 1
#define _SAI2_MCLK_A_PC6_ 1
#define _SAI2_MCLK_A_PD9_ 1
#define _SAI2_MCLK_A_PG11_ 1

