susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32L4P.h
#define TIM3_ETR_PD2_ PD2,GPIO_AF2
#define TIM3_ETR_PE2_ PE2,GPIO_AF2
#define _TIM3_ETR_PD2_ 1
#define _TIM3_ETR_PE2_ 1

#define TIM4_CH1_PB6_ PB6,GPIO_AF2
#define TIM4_CH1_PD12_ PD12,GPIO_AF2
#define _TIM4_CH1_PB6_ 1
#define _TIM4_CH1_PD12_ 1

#define TIM4_CH2_PB7_ PB7,GPIO_AF2
#define TIM4_CH2_PD13_ PD13,GPIO_AF2
#define _TIM4_CH2_PB7_ 1
#define _TIM4_CH2_PD13_ 1

#define TIM4_CH3_PB8_ PB8,GPIO_AF2
#define TIM4_CH3_PD14_ PD14,GPIO_AF2
#define _TIM4_CH3_PB8_ 1
#define _TIM4_CH3_PD14_ 1

#define TIM4_CH4_PB9_ PB9,GPIO_AF2
#define TIM4_CH4_PD15_ PD15,GPIO_AF2
#define _TIM4_CH4_PB9_ 1
#define _TIM4_CH4_PD15_ 1

#define TIM4_ETR_PE0_ PE0,GPIO_AF2
#define _TIM4_ETR_PE0_ 1

#define TIM5_CH1_PA0_ PA0,GPIO_AF2
#define TIM5_CH1_PF6_ PF6,GPIO_AF2
#define TIM5_CH1_PH10_ PH10,GPIO_AF2
#define _TIM5_CH1_PA0_ 1
#define _TIM5_CH1_PF6_ 1
#define _TIM5_CH1_PH10_ 1

#define TIM5_CH2_PA1_ PA1,GPIO_AF2
#define TIM5_CH2_PF7_ PF7,GPIO_AF2
#define TIM5_CH2_PH11_ PH11,GPIO_AF2
#define _TIM5_CH2_PA1_ 1
#define _TIM5_CH2_PF7_ 1
#define _TIM5_CH2_PH11_ 1

#define TIM5_CH3_PA2_ PA2,GPIO_AF2
#define TIM5_CH3_PF8_ PF8,GPIO_AF2
#define TIM5_CH3_PH12_ PH12,GPIO_AF2
#define _TIM5_CH3_PA2_ 1
#define _TIM5_CH3_PF8_ 1
#define _TIM5_CH3_PH12_ 1

#define TIM5_CH4_PA3_ PA3,GPIO_AF2
#define TIM5_CH4_PF9_ PF9,GPIO_AF2
#define TIM5_CH4_PI0_ PI0,GPIO_AF2
#define _TIM5_CH4_PA3_ 1
#define _TIM5_CH4_PF9_ 1
#define _TIM5_CH4_PI0_ 1

#define TIM5_ETR_PF6_ PF6,GPIO_AF1
#define _TIM5_ETR_PF6_ 1

#define TIM8_BKIN_PA6_ PA6,GPIO_AF13
#define TIM8_BKIN_PB7_ PB7,GPIO_AF13
#define TIM8_BKIN_PI4_ PI4,GPIO_AF3
#define _TIM8_BKIN_PA6_ 1
#define _TIM8_BKIN_PB7_ 1
#define _TIM8_BKIN_PI4_ 1

#define TIM8_BKIN2_PB6_ PB6,GPIO_AF12
#define TIM8_BKIN2_PC9_ PC9,GPIO_AF14
#define _TIM8_BKIN2_PB6_ 1
#define _TIM8_BKIN2_PC9_ 1

#define TIM8_CH1_PC6_ PC6,GPIO_AF3
#define TIM8_CH1_PI5_ PI5,GPIO_AF3
#define _TIM8_CH1_PC6_ 1
#define _TIM8_CH1_PI5_ 1

#define TIM8_CH1N_PA5_ PA5,GPIO_AF3
#define TIM8_CH1N_PA7_ PA7,GPIO_AF3
#define TIM8_CH1N_PH13_ PH13,GPIO_AF3
#define _TIM8_CH1N_PA5_ 1
#define _TIM8_CH1N_PA7_ 1
#define _TIM8_CH1N_PH13_ 1

#define TIM8_CH2_PC7_ PC7,GPIO_AF3
#define TIM8_CH2_PI6_ PI6,GPIO_AF3
#define _TIM8_CH2_PC7_ 1
#define _TIM8_CH2_PI6_ 1

#define TIM8_CH2N_PB0_ PB0,GPIO_AF3
#define TIM8_CH2N_PB14_ PB14,GPIO_AF3
#define TIM8_CH2N_PH14_ PH14,GPIO_AF3
#define _TIM8_CH2N_PB0_ 1
#define _TIM8_CH2N_PB14_ 1
#define _TIM8_CH2N_PH14_ 1

#define TIM8_CH3_PC8_ PC8,GPIO_AF3
#define TIM8_CH3_PI7_ PI7,GPIO_AF3
#define _TIM8_CH3_PC8_ 1
#define _TIM8_CH3_PI7_ 1

#define TIM8_CH3N_PB1_ PB1,GPIO_AF3
#define TIM8_CH3N_PB15_ PB15,GPIO_AF3
#define TIM8_CH3N_PH15_ PH15,GPIO_AF3
#define _TIM8_CH3N_PB1_ 1
#define _TIM8_CH3N_PB15_ 1
#define _TIM8_CH3N_PH15_ 1

#define TIM8_CH4_PC9_ PC9,GPIO_AF3
#define TIM8_CH4_PI2_ PI2,GPIO_AF3
#define _TIM8_CH4_PC9_ 1
#define _TIM8_CH4_PI2_ 1

#define TIM8_ETR_PA0_ PA0,GPIO_AF3
#define TIM8_ETR_PI3_ PI3,GPIO_AF3
#define _TIM8_ETR_PA0_ 1
#define _TIM8_ETR_PI3_ 1

#define TSC_G1_IO1_PB12_ PB12,GPIO_AF9
#define _TSC_G1_IO1_PB12_ 1

#define TSC_G1_IO2_PB13_ PB13,GPIO_AF9
#define _TSC_G1_IO2_PB13_ 1

#define TSC_G1_IO3_PB14_ PB14,GPIO_AF9
#define _TSC_G1_IO3_PB14_ 1

#define TSC_G1_IO4_PB15_ PB15,GPIO_AF9
#define _TSC_G1_IO4_PB15_ 1

#define TSC_G2_IO1_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF9
#define _TSC_G2_IO1_PB4 (NJTRST)_ 1

#define TSC_G2_IO2_PB5_ PB5,GPIO_AF9
#define _TSC_G2_IO2_PB5_ 1

#define TSC_G2_IO3_PB6_ PB6,GPIO_AF9
#define _TSC_G2_IO3_PB6_ 1

#define TSC_G2_IO4_PB7_ PB7,GPIO_AF9
#define _TSC_G2_IO4_PB7_ 1

#define TSC_G3_IO1_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF9
#define _TSC_G3_IO1_PA15 (JTDI)_ 1

#define TSC_G3_IO2_PC10_ PC10,GPIO_AF9
#define _TSC_G3_IO2_PC10_ 1

#define TSC_G3_IO3_PC11_ PC11,GPIO_AF9
#define _TSC_G3_IO3_PC11_ 1

#define TSC_G3_IO4_PC12_ PC12,GPIO_AF9
#define _TSC_G3_IO4_PC12_ 1

#define TSC_G4_IO1_PC6_ PC6,GPIO_AF9
#define _TSC_G4_IO1_PC6_ 1

#define TSC_G4_IO2_PC7_ PC7,GPIO_AF9
#define _TSC_G4_IO2_PC7_ 1

#define TSC_G4_IO3_PC8_ PC8,GPIO_AF9
#define _TSC_G4_IO3_PC8_ 1

#define TSC_G4_IO4_PC9_ PC9,GPIO_AF9
#define _TSC_G4_IO4_PC9_ 1

#define TSC_G5_IO1_PE10_ PE10,GPIO_AF9
#define _TSC_G5_IO1_PE10_ 1

#define TSC_G5_IO2_PE11_ PE11,GPIO_AF9
#define _TSC_G5_IO2_PE11_ 1

#define TSC_G5_IO3_PE12_ PE12,GPIO_AF9
#define _TSC_G5_IO3_PE12_ 1

#define TSC_G5_IO4_PE13_ PE13,GPIO_AF9
#define _TSC_G5_IO4_PE13_ 1

#define TSC_G6_IO1_PD10_ PD10,GPIO_AF9
#define _TSC_G6_IO1_PD10_ 1

#define TSC_G6_IO2_PD11_ PD11,GPIO_AF9
#define _TSC_G6_IO2_PD11_ 1

#define TSC_G6_IO3_PD12_ PD12,GPIO_AF9
#define _TSC_G6_IO3_PD12_ 1

#define TSC_G6_IO4_PD13_ PD13,GPIO_AF9
#define _TSC_G6_IO4_PD13_ 1

#define TSC_G7_IO1_PE2_ PE2,GPIO_AF9
#define _TSC_G7_IO1_PE2_ 1

#define TSC_G7_IO2_PE3_ PE3,GPIO_AF9
#define _TSC_G7_IO2_PE3_ 1

#define TSC_G7_IO3_PE4_ PE4,GPIO_AF9
#define _TSC_G7_IO3_PE4_ 1

#define TSC_G7_IO4_PE5_ PE5,GPIO_AF9
#define _TSC_G7_IO4_PE5_ 1

#define TSC_G8_IO1_PF14_ PF14,GPIO_AF9
#define _TSC_G8_IO1_PF14_ 1

#define TSC_G8_IO2_PF15_ PF15,GPIO_AF9
#define _TSC_G8_IO2_PF15_ 1

#define TSC_G8_IO3_PG0_ PG0,GPIO_AF9
#define _TSC_G8_IO3_PG0_ 1

#define TSC_G8_IO4_PG1_ PG1,GPIO_AF9
#define _TSC_G8_IO4_PG1_ 1

#define TSC_SYNC_PB10_ PB10,GPIO_AF9
#define TSC_SYNC_PD2_ PD2,GPIO_AF9
#define _TSC_SYNC_PB10_ 1
#define _TSC_SYNC_PD2_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define UART1_CK_PB5_ PB5,GPIO_AF7
#define UART1_CK_PG13_ PG13,GPIO_AF7
#define _UART1_CK_PA8_ 1
#define _UART1_CK_PB5_ 1
#define _UART1_CK_PG13_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define UART1_CTS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF7
#define UART1_CTS_PG11_ PG11,GPIO_AF7
#define _UART1_CTS_PA11_ 1
#define _UART1_CTS_PB4 (NJTRST)_ 1
#define _UART1_CTS_PG11_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define UART1_DE_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF7
#define UART1_DE_PG12_ PG12,GPIO_AF7
#define _UART1_DE_PA12_ 1
#define _UART1_DE_PB3 (JTDO/TRACESWO)_ 1
#define _UART1_DE_PG12_ 1

#define UART1_NSS_PA11_ PA11,GPIO_AF7
#define UART1_NSS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF7
#define UART1_NSS_PG11_ PG11,GPIO_AF7
#define _UART1_NSS_PA11_ 1
#define _UART1_NSS_PB4 (NJTRST)_ 1
#define _UART1_NSS_PG11_ 1

